package MyInterviewRecord;

/**
 * # 第一题
 * # 日志采样: 从超大规模的 query 日志文件中，按 query 出现概率，进行无放回随机采样
 *
 * #   输入：1）query log文件，每行为一个 query 记录，分2列，第一列为 query 内容，第二列为 query 频次
 * #           例：
 * #             三岁宝宝肚子痛怎么办 \t 899
 * #             什么退烧药适合宝宝用 \t 873
 * #             ...
 * #
 * #        2) 无放回采样数量 N
 * #
 * #   输出： N 个不同的 query 列表
 *
 *
 * ## 第二题：句子生成
 * #     输入：
 * #         不定长数组，每个成员也是不定长子数组，子数字成员为单词（字符串）
 * #         words = [[A, B, C...], [a, b, c...], [甲, 乙, 丙...] ...]
 * #     输出：
 * #         按数组顺序，从每个子数组中取一个单词，拼接生成一个句子，输出所有可能句子
 * #         sents = [Aa甲, Aa乙, Aa丙, Ab甲, Ab乙 ... ]
 */
public class 百度nlp_1 {
}
